import * as React from "react";

export default class HomeComponent extends React.Component {
    render() {
        return (
            <main>
                <h1>The New Word 2</h1>
                <h2>Додаток для вивчення та повторення іноземних слів</h2>
                <ul>
                    <li><strong>Основна ціль додатку.</strong>
                        <span> Ціль додатку - допомогти вам вчити нові іноземні слова та вирази.</span>
                    </li>
                    <li><strong>Чи допоможе додаток вивчити правила чи речення?</strong>
                        <span> Ні, додаток розрахований лише на слова та прості вирази. Технічно, ніхто не може вам заборогити
                        вчити речення, але це буде малоефективно, тому що речення зазвичай можна побудувати багатьма
                        способами.</span>
                    </li>
                    <li><strong>Як це працює?</strong>
                        <span> Коли ви зайдете в додаток, він запропонує вам на переклад набір слів з рідної мови на іноземну.
                            Ви мусите власноруч з клавіатури ввести це слово без ніякої підказки, набору літер та ін., на відміну від
                            аналогічних сервісів. Причина очевидна - нема підказки, більше хардкору, краще вивчається правопис.
                            Для спецсимволів, можна налаштувати клавіатуру.</span>
                    </li>
                </ul>
            </main>
        )
    }
}
